numbers = [10, 8, 1, 3, 7, 12,4,5,7,9]    #задаю список чисел
current_streak=[]     #задаю список для поточної послідовності
all_longest=[]        #задаю список для найдовшої послідовності     
for n in range(len(numbers)-1):    #задаю ренж для подальшої роботи з умовою
    if numbers[n] < numbers[n+1]:  #задаю умову для відбору зростаючих чисел
        current_streak.append(numbers[n])   #розширюю список поточної послідовності,якщо умова виконується
    else:   #додаю else для того,щоб не втрачати останнє число в послідовності при її перериванні
        if current_streak:#перевіряю чи список поточної послідовності не пустий
            current_streak.append(numbers[n])#додаю останнє число в поточну послідовність
        if not all_longest or len(current_streak) > len(all_longest[0]):  #задаю умову для порівняння довжини поточної послідовності з довжиною найдовшої,перша частина з not,щоб програма не видала помилку
            all_longest = [current_streak]# квадратні дужки,щоб додати список,а не 1 послідовнсть,яка потім перезапишеться
        elif len(current_streak) == len(all_longest[0]):  #якщо попередній стрік такої ж довжини,як і поточний
            all_longest.append(current_streak) #додаю його в список всіх найдовших послідовностей
        current_streak = []  #обнуляю список поточної послідовності,щоб перейти до наступної можливої
if current_streak: #це для того,щоб коли останнє число в списку є частиною зростаючої послідовності,то воно не втратилося
     current_streak.append(numbers[-1])  #додаю останнє число в поточну послідовність
     if not all_longest or len(current_streak) > len(all_longest[0]): #після того,як додав останнє число,перевіряю чи поточна послідовність найдовша
        all_longest = [current_streak] #додаю саме список поточної послідовності,а не 1 послідовність,щоб не втратити інші
     elif len(current_streak) == len(all_longest[0]): #те саме,що і вище
        all_longest.append(current_streak) #розширив список
print(all_longest)  #виводжу всі найдовші послідовності

        
       
        



